{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "0f832c0e",
   "metadata": {},
   "outputs": [],
   "source": [
    "from neo4j import GraphDatabase"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "id": "d311faa4",
   "metadata": {},
   "outputs": [],
   "source": [
    "# establishing connection\n",
    "graphdb = GraphDatabase.driver(uri=\"bolt://localhost:7687\",auth=(\"neo4j\",\"Omega@123\"))\n",
    "graphdb"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "id": "e5b8c159",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<Record n=<Node element_id='4:44263fe2-cd7a-4619-98d0-d011008b53c2:0' labels=frozenset({'CHARACTERS'}) properties={'name': 'Monkey D. Luffy', 'height': 174}>>\n",
      "<Record n=<Node element_id='4:44263fe2-cd7a-4619-98d0-d011008b53c2:1' labels=frozenset({'CHARACTERS'}) properties={'name': 'Uchiha Sasuke', 'height': 168}>>\n",
      "<Record n=<Node element_id='4:44263fe2-cd7a-4619-98d0-d011008b53c2:2' labels=frozenset({'CHARACTERS'}) properties={'name': 'Roronoa Zoro', 'height': 178}>>\n",
      "<Record n=<Node element_id='4:44263fe2-cd7a-4619-98d0-d011008b53c2:3' labels=frozenset({'TEAM'}) properties={'name': 'Straw Hats'}>>\n",
      "<Record n=<Node element_id='4:44263fe2-cd7a-4619-98d0-d011008b53c2:4' labels=frozenset({'CHARACTERS'}) properties={'name': 'Uzumaki Naruto', 'height': 166}>>\n",
      "<Record n=<Node element_id='4:44263fe2-cd7a-4619-98d0-d011008b53c2:5' labels=frozenset({'TEAM'}) properties={'name': 'Team 7'}>>\n",
      "<Record n=<Node element_id='4:44263fe2-cd7a-4619-98d0-d011008b53c2:6' labels=frozenset({'TITLE'}) properties={'year': 2002, 'name': 'Naruto Shippuden'}>>\n",
      "<Record n=<Node element_id='4:44263fe2-cd7a-4619-98d0-d011008b53c2:7' labels=frozenset({'TITLE'}) properties={'year': 1999, 'name': 'One Piece'}>>\n",
      "<Record n=<Node element_id='4:44263fe2-cd7a-4619-98d0-d011008b53c2:8' labels=frozenset({'CHARACTERS'}) properties={'name': 'Haruno Sakura', 'height': 168}>>\n",
      "<Record n=<Node element_id='4:44263fe2-cd7a-4619-98d0-d011008b53c2:9' labels=frozenset({'CHARACTERS'}) properties={'name': 'Sanji', 'height': 180}>>\n",
      "<Record n=<Node element_id='4:44263fe2-cd7a-4619-98d0-d011008b53c2:10' labels=frozenset({'CHARACTERS'}) properties={'name': 'Nami', 'height': 170}>>\n",
      "<Record n=<Node element_id='4:44263fe2-cd7a-4619-98d0-d011008b53c2:11' labels=frozenset({'CHARACTERS'}) properties={'name': 'Nico Robin', 'height': 188}>>\n",
      "<Record n=<Node element_id='4:44263fe2-cd7a-4619-98d0-d011008b53c2:12' labels=frozenset({'CHARACTERS'}) properties={'name': 'Tony Chopper', 'height': 90}>>\n",
      "<Record n=<Node element_id='4:44263fe2-cd7a-4619-98d0-d011008b53c2:13' labels=frozenset({'CHARACTERS'}) properties={'name': 'Franky', 'height': 240}>>\n",
      "<Record n=<Node element_id='4:44263fe2-cd7a-4619-98d0-d011008b53c2:14' labels=frozenset({'CHARACTERS'}) properties={'name': 'Brook', 'height': 277}>>\n",
      "<Record n=<Node element_id='4:44263fe2-cd7a-4619-98d0-d011008b53c2:15' labels=frozenset({'TEAM'}) properties={'name': 'Team 10'}>>\n",
      "<Record n=<Node element_id='4:44263fe2-cd7a-4619-98d0-d011008b53c2:16' labels=frozenset({'CHARACTERS'}) properties={'name': 'Shikamaru Nara', 'height': 170}>>\n",
      "<Record n=<Node element_id='4:44263fe2-cd7a-4619-98d0-d011008b53c2:17' labels=frozenset({'CHARACTERS'}) properties={'name': 'Choji Akimichi', 'height': 172}>>\n",
      "<Record n=<Node element_id='4:44263fe2-cd7a-4619-98d0-d011008b53c2:18' labels=frozenset({'CHARACTERS'}) properties={'name': 'Ino Yamanaka', 'height': 162}>>\n"
     ]
    }
   ],
   "source": [
    "# Search all nodes \n",
    "session = graphdb.session()\n",
    "q1 = \"MATCH (n) RETURN n\"\n",
    "nodes = session.run(q1)\n",
    "for node in nodes:\n",
    "    print(node)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "id": "fa0b3dd8",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<Record n=<Node element_id='4:44263fe2-cd7a-4619-98d0-d011008b53c2:0' labels=frozenset({'CHARACTERS'}) properties={'name': 'Monkey D. Luffy', 'height': 174}>>\n",
      "<Record n=<Node element_id='4:44263fe2-cd7a-4619-98d0-d011008b53c2:1' labels=frozenset({'CHARACTERS'}) properties={'name': 'Uchiha Sasuke', 'height': 168}>>\n",
      "<Record n=<Node element_id='4:44263fe2-cd7a-4619-98d0-d011008b53c2:2' labels=frozenset({'CHARACTERS'}) properties={'name': 'Roronoa Zoro', 'height': 178}>>\n",
      "<Record n=<Node element_id='4:44263fe2-cd7a-4619-98d0-d011008b53c2:3' labels=frozenset({'TEAM'}) properties={'name': 'Straw Hats'}>>\n",
      "<Record n=<Node element_id='4:44263fe2-cd7a-4619-98d0-d011008b53c2:4' labels=frozenset({'CHARACTERS'}) properties={'name': 'Uzumaki Naruto', 'height': 166}>>\n"
     ]
    }
   ],
   "source": [
    "# Search nodes with LIMIT\n",
    "session = graphdb.session()\n",
    "q1 = \"MATCH (n) RETURN n LIMIT 5\"\n",
    "nodes = session.run(q1)\n",
    "for node in nodes:\n",
    "    print(node)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "id": "845ec99a",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<Record n=<Node element_id='4:44263fe2-cd7a-4619-98d0-d011008b53c2:1' labels=frozenset({'CHARACTERS'}) properties={'name': 'Uchiha Sasuke', 'height': 168}>>\n",
      "<Record n=<Node element_id='4:44263fe2-cd7a-4619-98d0-d011008b53c2:8' labels=frozenset({'CHARACTERS'}) properties={'name': 'Haruno Sakura', 'height': 168}>>\n"
     ]
    }
   ],
   "source": [
    "# Search nodes with properties\n",
    "session = graphdb.session()\n",
    "q1 = \"MATCH (n) WHERE n.height = 168 RETURN n\"\n",
    "nodes = session.run(q1)\n",
    "for node in nodes:\n",
    "    print(node)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "id": "fc14a522",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<Record n=<Node element_id='4:44263fe2-cd7a-4619-98d0-d011008b53c2:11' labels=frozenset({'CHARACTERS'}) properties={'name': 'Nico Robin', 'height': 188}>>\n"
     ]
    }
   ],
   "source": [
    "# Search nodes with properties\n",
    "session = graphdb.session()\n",
    "q1 = \"MATCH (n) WHERE n.name='Nico Robin' RETURN n\"\n",
    "nodes = session.run(q1)\n",
    "for node in nodes:\n",
    "    print(node)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 28,
   "id": "7a633155",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<Record n=<Node element_id='4:44263fe2-cd7a-4619-98d0-d011008b53c2:19' labels=frozenset({'POWERS'}) properties={}>>\n",
      "<Record n=<Node element_id='4:44263fe2-cd7a-4619-98d0-d011008b53c2:20' labels=frozenset({'POWERS'}) properties={}>>\n"
     ]
    }
   ],
   "source": [
    "# create node with label\n",
    "session = graphdb.session()\n",
    "q1 = \"CREATE (p:POWERS)\"\n",
    "session.run(q1)\n",
    "q2 = \"MATCH (n:POWERS) RETURN n\"\n",
    "nodes = session.run(q2)\n",
    "for node in nodes:\n",
    "    print(node)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 29,
   "id": "b234c9a3",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<Record n=<Node element_id='4:44263fe2-cd7a-4619-98d0-d011008b53c2:19' labels=frozenset({'POWERS'}) properties={}>>\n"
     ]
    }
   ],
   "source": [
    "# Delete node with id\n",
    "session = graphdb.session()\n",
    "q1 = \"MATCH (n:POWERS) WHERE ID(n)=20 DELETE n\"\n",
    "session.run(q1)\n",
    "q2 = \"MATCH (n:POWERS) RETURN n\"\n",
    "nodes = session.run(q2)\n",
    "for node in nodes:\n",
    "    print(node)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 30,
   "id": "67d0ebd3",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<Record p=<Node element_id='4:44263fe2-cd7a-4619-98d0-d011008b53c2:19' labels=frozenset({'POWERS'}) properties={'name': 'Powers'}>>\n"
     ]
    }
   ],
   "source": [
    "# Update the label node => POWERS to name = Powers\n",
    "session = graphdb.session()\n",
    "q1 = \"MATCH (p:POWERS) SET p.name = 'Powers' RETURN p\"\n",
    "nodes = session.run(q1)\n",
    "for node in nodes:\n",
    "    print(node)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 31,
   "id": "3e34c86d",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Create relation and its properties for all the character nodes\n",
    "q1 = \"MATCH (c:CHARACTERS), (p:POWERS) CREATE (c)-[:HAS_POWERS]->(p) \"\n",
    "nodes = session.run(q1)\n",
    "for node in nodes:\n",
    "    print(node)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "71ff8f3b",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.5"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
